Catalogs/ЭлементыКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементыКонструктораВидовПродукцииИС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестаПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаПримененияЭлементовКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаПримененияЭлементовКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыКонструктораВидовПродукцииИС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЭлементыКонструктораВидовПродукцииИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ДоступностьНастроек = ТекущиеДанные <> Неопределено И Не ТекущиеДанные.ЭтоГруппа;
	
	Элементы.СписокКонтекстноеМенюНастроитьЭлемент.Доступность           = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьДоступныеЗначения.Доступность = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьМестаПрименения.Доступность   = ДоступностьНастроек;
	Элементы.СписокКонтекстноеМенюНастроитьДоступныеЗначенияПоМестамПрименения.Доступность = ДоступностьНастроек;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКонструкторВидовПродукции(Команда)
	
	ОткрытьФорму("РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.КонструкторВидовПродукцииИС");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМестаПрименения(Команда)
	
	ОткрытьФорму("Справочник.МестаПримененияЭлементовКонструктораВидовПродукцииИС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДоступныхЗначений(Команда)
	
	ОткрытьФорму("РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначений");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлемент(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.КонструкторВидовПродукцииИС",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначений",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьМестаПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.МестаПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаМестПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступныеЗначенияПоМестамПрименения(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭлементКонструктора", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступныеЗначенияПоМестамПримененияЭлементовКонструктораВидовПродукцииИС.Форма.НастройкаДоступныхЗначенийПоМестамПрименения",
		ПараметрыОткрытия,
		ЭтотОбъект,
		ПараметрыОткрытия.ЭлементКонструктора);
	
КонецПроцедуры

#КонецОбласти
